app/views/hackers/index.html.erb

        <p>Hacks: $hacknames</p>
     <p>My tags: <%= raw hacker.tag_list.map { |t| link_to t, tag_path(t) }.join(', ') %></p>
---
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN hackers ON hackers.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Hacker' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT hackers.id FROM "hackers" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id