app/views/hacks/index.html.erb

SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN events ON events.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Event' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT events.id FROM "events" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
        <p><%= hack.description %></p>
        <p><%= raw hack.tag_list.map { |t| link_to t, tag_path(t) }.join(', ') %></p>