app/controllers/events_controller.rb

SELECT "events".* FROM "events" JOIN taggings events_taggings_d7e0ae6 ON events_taggings_d7e0ae6.taggable_id = events.id AND events_taggings_d7e0ae6.taggable_type = 'Event' AND events_taggings_d7e0ae6.tag_id = 11
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN events ON events.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Event' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT events.id FROM "events" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
  def index

    if params[:tag]

    @events = Event.tagged_with(params[:tag])

    else

    @events = Event.all

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @event = Event.find(params[:id])

INSERT INTO "events" ("city", "country", "created_at", "date", "description", "email", "event_id", "facebook_id", "logo", "name", "owner", "street_address", "time", "twitter_id", "updated_at", "url", "venue", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "events" SET "description" = 'We''re back in South East Asia with the biggest and best hackday yet!', "updated_at" = '2013-02-22 14:33:26.909337' WHERE "events"."id" = 2
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 4]]
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy