app/controllers/hackers_controller.rb

  def index

    if params[:tag]

      @hackers = Hacker.tagged_with(params[:tag])

    elsif params[:id]

    # select * from hackers where id in (select hacker_id from events_hackers_teams where event_id = params[:id]);
      @hackers = Hacker.where(id: EventsHackersTeams.select("hacker_id").where(event_id: params[:id]))

    else

      @hackers = Hacker.all
---
SELECT "hackers".* FROM "hackers" WHERE "hackers"."hackerid" IN (SELECT hacker_id FROM "events_hackers_teams" WHERE "events_hackers_teams"."event_id" = 1)
SELECT "events_hackers_teams".* FROM "events_hackers_teams"
SELECT "hackers".* FROM "hackers" JOIN taggings hackers_taggings_991a6dd ON hackers_taggings_991a6dd.taggable_id = hackers.id AND hackers_taggings_991a6dd.taggable_type = 'Hacker' AND hackers_taggings_991a6dd.tag_id = 14
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN hackers ON hackers.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Hacker' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT hackers.id FROM "hackers" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id

  def show
    @hacker = Hacker.find(params[:id])
---
SELECT "hackers".* FROM "hackers" WHERE "hackers"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @hacker = Hacker.find(params[:id])
---
SELECT "hackers".* FROM "hackers" WHERE "hackers"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @hacker = Hacker.new(params[:hacker])

    respond_to do |format|
      if @hacker.save
---
INSERT INTO "hackers" ("city", "company", "country", "created_at", "dob", "facebook_id", "fname", "jobtitle", "lname", "team_id", "twitter_id", "uname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @hacker = Hacker.find(params[:id])

    respond_to do |format|
      if @hacker.update_attributes(params[:hacker])
---
SELECT "hackers".* FROM "hackers" WHERE "hackers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "hackers" SET "updated_at" = '2013-02-11 13:06:59.398129' WHERE "hackers"."id" = 1

  def destroy
    @hacker = Hacker.find(params[:id])
    @hacker.destroy
---
SELECT "hackers".* FROM "hackers" WHERE "hackers"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "hackers" WHERE "hackers"."id" = ?  [["id", 4]]