app/controllers/hacks_controller.rb

SELECT "hacks".* FROM "hacks" JOIN taggings hacks_taggings_8a6e4fe ON hacks_taggings_8a6e4fe.taggable_id = hacks.id AND hacks_taggings_8a6e4fe.taggable_type = 'Hack' AND hacks_taggings_8a6e4fe.tag_id = 17
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN events ON events.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Event' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT events.id FROM "events" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
  def index
    @event = Event.find(params[:id])

    # if tag and event id passed in
    if params[:tag] && params[:id]

      #get hacks from teams at the specified event which are tagged with tag
      @hacks = Hack.tagged_with(params[:tag]).where(team_id: Team.select("id").where(event_id: params[:id]))
      @attendances = Attendance.where("user_id = ?", current_user.id)
    # if an event id, but no tag filter
    elsif params[:id]
      # get the hacks from the teams at the event
      # join == 0.1ms
      @hacks = Hack.joins(:team).where(:teams => { :event_id => params[:id] })
      @attendances = Attendance.where("user_id = ?", current_user.id) if current_user

    # else if there's a tag, but no event id
    elsif params[:tag] and not params[:id]

      #get all hacks tagged with tag across all event
      @hacks = Hack.tagged_with(params[:tag])

    else

      #get all hacks if no params for event or tag are passed through
      @hacks = Hack.all

SELECT "hacks".* FROM "hacks" WHERE "hacks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @hack = Hack.find(params[:hack_id])

SELECT "hacks".* FROM "hacks" WHERE "hacks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @hack = Hack.find(params[:hack_id])

INSERT INTO "hacks" ("created_at", "description", "event_id", "logo", "name", "team_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", Fri, 15 Feb 2013 16:13:26 UTC +00:00], ["description", nil], ["event_id", nil], ["logo", nil], ["name", nil], ["team_id", nil], ["updated_at", Fri, 15 Feb 2013 16:13:26 UTC +00:00]]
---
  def create
    @hack = Hack.new(params[:hack])

    respond_to do |format|
      if @hack.save

SELECT "hacks".* FROM "hacks" WHERE "hacks"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "hacks" SET "event_id" = 1, "updated_at" = '2013-02-11 18:11:41.414625' WHERE "hacks"."id" = 1
---
  def update
    @hack = Hack.find(params[:hack_id])

    respond_to do |format|
      if @hack.update_attributes(params[:hack])

SELECT "hacks".* FROM "hacks" WHERE "hacks"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "hacks" WHERE "hacks"."id" = ?  [["id", 4]]
---
  def destroy
    @hack = Hack.find(params[:id])
    @hack.destroy