app/controllers/teams_controller.rb

  def index
  @event = Event.find(params[:id])

   if params[:tag]

    # this needs to be limited to teams in specific event
    # although tags are not set upfor teams yet
    @teams = Team.tagged_with(params[:tag])

   elsif params[:id]

   @teams = Team.joins(:users).where(:teams => { :event_id => params[:id] })
   @attendances = Attendance.where("user_id = ?", current_user.id)

   # select * from teams where id in (select team_id from events_hackers_hacks_teams where event_id = 1);
   # @teams = Team.where(id: EventsHackersHacksTeams.select("team_id").where(event_id: params[:id]))

   else

    @teams = Team.all
---
SELECT "teams".* FROM "teams" WHERE "teams"."event_id" = '1'

  def show
    @team = Team.find(params[:team_id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("created_at", "description", "event_id", "logo", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 15 Feb 2013 16:13:26 UTC +00:00], ["description", nil], ["event_id", nil], ["logo", nil], ["name", nil], ["updated_at", Fri, 15 Feb 2013 16:13:26 UTC +00:00]]

  def update
    @team = Team.find(params[:id])

    respond_to do |format|
      if @team.update_attributes(params[:team])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "teams" SET "event_id" = 1, "updated_at" = '2013-02-11 18:38:13.958891' WHERE "teams"."id" = 1

  def destroy
    @team = Team.find(params[:id])
    @team.destroy
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 4]]